console.log("ȃ̵̢̯͎͖̘͕̝̙̼̖̲̮̭̯̱͎̬̞̟̘̖͕̀̂́͗̔̀̈́̍̓̋̌̎͗͛͆̈́̈̅͛̇̈́̋̉̔̄̀̽̀͆͋̈͘͘͘͘͜͝͝ͅb̵̛̛̜̱̣͌̆̃̂̒͂̒̔̾̈́͂̑̅̈́̓͒̈́̏͌̀͂́̈́͋͛̆̃͂̿͆̍̇͗͌͆́͆̍̂̉̈͑̍̓̓͌̌̀͗̒̌̍̕̕̚̕̕͝͠ͅs̵̡̛̛͓̬̻̼̼͓̠̩̬͓̠̺͎̬͈̠̲̖̯̺̣̙̮̬̞͓̪͇̙̈̅̏̈́͋̆̐́́͋̔̇̈́̿̐̈̒̓͌̓̈͋̾̈́̾̐̓̋̄͌̍̚̚̚̚̚̕͜͝ͅͅc̶̡̨̛̠̝̬͈̭̳͈͓͖͙̘̺̪͕͓͇̣̻̘͍͈͔̹̥͚̳̻̦͓̺̹͍͉̥͖̟͑̈́̑̀́̇̉͊́̄̓́̽̑͗̋͘ǫ̵̢̩͔̠͕̞͓̗͓̀̓̎̎̑͗̃͒͂͊̓͌͋̐̃̔͊̏͌͌̃͛̌̎̑̊̏̃͋͌̊̎̑̿̅̆͑̍̚̚̕̕͠͠͝ͅń̵̡̧̳̪̣̼͔̫͓͚͍̬͕̼͚̦̱̱̦̥̥̈́͌͂̔̋͑̔͊͐̊̑͘̕d̶̛̪͙̩̬̟͎͉̮͖̖̯̂̆̅̍̌̀̿̀̒̏̆͂̈̈́͂̐̑̌̑̒̉͌͋̏͑̉̀͊̓̈́͋̈́̚̚͘͘͘͝ị̶̢̧̢̧̛̣͚̺̞͙̗͔̥̭͖͓̲̪̝͈̮̝̞̲̱̼͍̇͂̄̈̆̇̄̈́́̈̉̈́̄͑̃͊͊̃̄̈́̓̈́͋́̓̈́̀̏̚͘̕͠͝͝͝ͅt̶̨̨̨̰̦̹͕̝̰̩̻̯͓̝̳͈̺̳̥͎̻̯̮̱̭̼̪̞̜̫̹̪͍͚͙̣͙͚̟͊͊͐̋͐͋͗͋͂͒̄̀͋͊̓̅͘͜͜͝͠ͅͅų̶̨̡̣̝̹͖̖̱̠̼̺͎̳͚̣̬̫̖̳͕̯͓̜̲̼̟̫̥̤̻̰̜̹͕̻̙̫͈̻͍̻̤͇̱̊̏͋̾̈́̄̽̏̀͌͑̍͐̍̑́͆̈́̃͛̓̅͐̿͐̃̾͆̏́̒̀͐̆͗͂̇̿̅̚̕͘͘̚͜͝͠͠͠ͅͅm̴̢̢̨͈̳͎͈̥̻̦̞̦̬͑̈́́̀̽̀͒̈́̈́͗́̔̌̓̀̈͐̃̇̄̎̊͌̇̊̒̃͊̌͒̑̓͒̉̇̏̏͐̑͊̂́̉̿̉̓͐̚̚̕̚̕͘͘̚͜͠͝͠");


const hewo = document.getElementById('hello');
const chars = "ABCDEFGHIJKLMNOPQRSTUVWXYZ abcdefghijklmnopqrstuvwxyz0123456789!@#$%^&*";
const buttonWarn = document.getElementById('translation4');
const buttonWarn2 = document.getElementById('translation5');

function changeHelloWorldChar() {
let text = hewo.innerText;
let textArray = text.split("");
const randomIndex = Math.floor(Math.random() * textArray.length);
const newChar = chars[Math.floor(Math.random() * chars.length)];
textArray[randomIndex] = newChar;
hewo.innerText = textArray.join("");
}
setInterval(changeHelloWorldChar, 500);


function message() {
	let greet = hewo.innerHTML;
	let name = prompt("enter your name");
	alert('Greetings, ' + name + '. ' + greet);
	if (name ==  "evil man") {
		alert('Entering evil land');
		window.open("evil.html");
	}else if (name == 'show me') {
		alert('you wish for the hints?');
		alert('visit the evil website and click on he who is red');
		alert('despite his looks he years to help you only');
		alert('safe travels, c̴̨̡̨̢̢̧̢̡̢̢̡̡̢̨̨̨̡̛̛̛̱̲̪͔̣̣̝̤̘͈͓̤̜͇̠̜͙͈͇̮̜͈͚̺̦̟͕͓̭̙̰̪̼̤̮̭̳̰̥̟̞͇͎̜̯̟͓͓̫̦͕͓̤͕̠̫͚̝̬̗̯̲̝̱̱̤̗̖̳̪͙͚̟̠̬͚̘̙͈̠̫̺͕͎̤̱̖̱͚̲̠͕̙̳̞̙̩̘̣̞̙̗͖̟̭̘͍̳͕̘͓̺̪͕̥̖̙̪̭͔̙͖̬̼̖͇̲͇̘̺͇̬̘͈̝̞͚̹͔̥̫̣̙͎̱̣͔͈͔͇̭̖͈̪̩̙͈̦̰̖͎̣̣̣̫̣̣̘͕̭̬̥̳͎͂́̀́̐̂́̑̔̀̔̍͒̅̈́̀͒͗́̿̍̽̽̾̓̇́̀͋̇̋̓̇̇̈́́̈́̈́̆̅̈͒͗̊͂͋͗͒̈͌̿̓͋̏̌̎̐̐̾̃͒́͑͊́̅̎̑͋͒̎̑͋̊̇̐͛̇̆̓̉̓̈́͛̔̐̎̿́̇̐͂́͋̊͐͗̍̃̇͆̈̑̍̉̈̀͋͌͑̅̑̆̎́̽̀̇̑̿̈́́̐̊̽͊̓͌̍̽̉̍̈́͊̽̂̊̑̔͋̑́̎͋̃̓͒̓̐̇̾͗̍̿̀͋̉̿͆͋̍̿̇̒͋̿̔́̿̏̓͘̚͘͘͘̚̕̚̕͜͜͜͜͜͜͜͝͠͝͝͠͝͝͝͝͝͠͠͝͝͝͝ͅͅh̴̨̧̢̨̨̨̡̢̧̧̢̢̧̨̢̨̨̡̡̨̡̧̡̧̛̛̛̫̦͈͇̝͉̻̮͉̖̝̩͍̝̹̠̟̲̜͕̤̭͍͎͖̦̤̮̖̦̠̝̹̦̱͎͓̩̼̳͚͇̩͇̻͈͖͎̭͔̯̬̦̘̥̻͕͚̩͎̬͍̭̯͈̪̖̩͙̗̳̺͉̳͕̦͍̤̝̦̤̺̱͔̼̱̭̣͈̭̺̝͔͖̭̬̣̣̣͓̯͈̜͍͇͙̯̺̬̫͍̬̩̤̰̞̭̪̗͈̱͉̩͔̯̝͇͈̝̠̣̱̪͓̯̪̖̟̥̹̹̝̙̺̹̝̲̪̬͖̜̤̰̻͚͎̹͈̠̺̺̬̦̝͈̥͕̖̝͎̩͎̬̳̖̭̰͔̜͎͈̬͈̩͍̻͔͕̰͕̘̹̖̣̝̞̤̱͙̱͇̯̫̱͍̩̤͙̱̖̥͕̖̪̙̼̲̩̥͈̗̝̟̣̰͕̮͔̗̟̣̮̝͖̝̮͙̺̗̜̼̻̦̞̹̙͊̄̂͆̓̽͌́̒̈́͛͂̌̓̽̅̄͊̋͛͛̃̀̓̑͒̓͛͌͛͒̾̀̏̑̄̾̓̆̆̄̌̀͆̓̊̈́͂͌̋͆͑̋͒̀̓̀̀̕̚̚͜͜͜͜͝͝͠͝͝͝͝͝͝ͅͅͅͅͅͅͅͅͅĩ̷̡̧̨̡̢̢̧̧̡̢̡̢̧̡̢̡̡̡̢̛̛̳̟͖̜̭͔̟̝͔̜̱̝͕͎̗̞͕͚̬̭͎̣̬̜̘͔̩̯̖̭͎̞͇̪͉̫̤̼͔̫̱͕͇͉͔͔̫͚̼̥̥̤̞̗͉͕̰͍̣̩̥̟̼̻̠͕̻͓̰̘͈̬̜̥͈̖̖̮̗̝̜̥͈͙̻͚͍̺̗̯͇̪̜͓͓̭̯̰͖͉͖̗͇͔͇̮̱̠͍͓͇̥̳̥̯͎̝̝̗̲̜̦̱̜̻̫̼̙̣̺̣̫̲̻̬̰̗͓̪̫̣̠̬͙͍͍̬̠͙̗̥͖̙̙̝̭̠̖̩̣͉̣̹͙͓̦̜̮̰̫̫͓̏͋͆̈̏̓͌̏͑͋͑̈͗͑̍̐̽͐͊̇̐̇̏̈́̑̔̈́̇́̐̽̂́̋̅̉̎̈́͛͆̽͌̉̄͗̋͗̊̂̈́̆͆̒͗̓̓̀͌̅̂̈́͌̉̈́̾̏̃͑͗̏͊̀͆̈́̓̅̎̉̌̏̈̋̂̋̊͌̂̅̃̎̒̇̈́̓̒́̓̃̒̋͋͐̏̈́̃̐̀́̇̔̓̅̆͒͊̇͗͛͐́̐̌̍̎̊̐͂̃͐̽̂̑̔̔͒̃̎͆͑̓̌̓̾̐̌̇̅̔̚̚̚̕͘͘͘̚̕̚̕͘̚͘̚͜͜͝͝͠͝͠͠͠͝͝͝͠͝͠ͅͅͅͅͅͅͅͅl̴̢̢̧̨̨̨̢̡̨̢̨̨̧̧̡̨̧̡̢̨̨̨̢̨̢̡̡̨̨̛̛̛̯̗̝̼̰̩͖̮̫̼̯̱̳̗̬͙̝̞̝̮̭̮͚̹̱̩̙̹̦̣̺̪̯̱͓̭̻͙̟̙̣̺͙̳̣̤̪̮̩̟̞̦̱͈̤̮̥̜̫̺̦͔͖̰̬͙͍̘͉̜̞̼̮̱͈̹̰̩̰͇̝̺̺͈͚̺̗̯̫̯̘̟̩͉̫̱̮͇͔̼̭͔͙̭̫̜̦̲̙̭̙͕̯̭̫̝̯̪͖̼̗̙̜̣͕̭̠͕̭̥̹͚͇̜̪͈̯̹̖͈̫͇̥̰̞̻̼̠̰͎͓̤̳̰̞̭͈͇̪̰̫̪͙̪͚̝̞̥͔͙̱̫̳̬̰̮͙̥̝͇̣͓̘̩̫͇̖̹̭̭͇̞̯̼͖̙̱͓̤̣̞̜̭̝̣̭̮̲̭͉̈̓̾̆̃͐̿̓̔̋̆̍̆̋́̀͊̉̆̇̓̾̿̓̓̽̉̇̅̑̋͂̒̅̓͂̈́̐͛͆̃̉͊̇̍̂̐̀̌̽̿͆̈́̆̆̎̃̈́̈͂̋̈̓̅͑͐͆̾́̏͆̑̒̈́̎͗̉̾́̍̇̑̄̀̒̔̀̎̐̋̈͛̒̉̇͒́̀̔̌̈́̊̉̃̄̌̀̀̔̏͛̄͂̈͗̆̅͒̾̌͆͐̄̐̍͋̋̽̓̋̈́͐̊͋̀̌́̐̃̇̓͘̕̕̕̚̕͘̚͘͘͘̕͜͝͝͝͝͝͠͠͝͠͝͝͠͝͝͝ͅͅͅḑ̶̧̨̨̢̧̧̡̡̧̨̢̢̢̨̨͉̯̬̗͙̞̬̳̝̲̫͖͚̰̲̱͈̻̦̗͎̲̳̞̩̗̝̜̫̥̫̰̻̬̠͚̖̯̩͙̯͍͖̼̹̼͇̻̠͇͕̥͔̘͓̜̥̝̰͈̯̩͈̝̖̭͔̬̻̞̜̜̥͓̣͔̜͓̗̖̞̦̻̳̼̳͕̮͉̺̣͚̯̤̹̪̼͎̤̫̩̜̪͂͒̂̂̄͐͐̉̎̀͊́̓̌͌͋̿̓̚͜͜͝͝ͅͅͅͅ');
	}else if (name == "$1933.52") {
		alert('MATH!');
	}else if (name == greet) {
		window.open("secret.html");
	}else if (name == "cinnthebun") {
		window.open("crane.html");
	};

};

const evilButton = document.getElementById('evil');

evilButton.addEventListener('mouseenter', function() {
	buttonWarn.innerHTML = "Ş̵̨̧̧̯̦͇͙̥͔̘͓̲̲̳̫̦̯͍̺̞̩̟̲͇͈̦͎͚̜̟͍̻̜̘͎͔͖͖̘͚̘̩̎͋͊̐̒̍̄͆͌̋̔͒̐͘͘͜͜͝į̸̡̡̢̢̢͕͙̼̫̮̬̱̗͙̭̯̯͍͍̳̟̲̻͛̉̿̏͂̌̓̍̋̅̋̾͂̃̾̂̍̈́̌͜͜͠͝ͅͅņ̸̡̢̨͙̬͕̣͚̼̘̝̣̦͙̯̳͈̰͚̣̺̬̱͐̈́́̾̉͛̄̔͛̄̅̈́̉̽͛͗̊̿̃̀̋̀͑͆͋͑́̎̃̆̀͑͗̎̓̈́͐̕̚̕̚͝͝ͅc̴̨̡̨̢̧̢̢̛͚͉̼͎̮͙͚̦̦͓̙̤̠̭͙̪̖͓̹͇̟̞̺̦̺̬̰̰̣̈́͐̈̈́̇̀͆͑̿̀̽̽̿͐̊̐̉͛̊͐͐̍̍̎̎̾́̄̒̌̔̏͘̚͜͜͜ͅͅẽ̶̡̺͔̫͒͌͊̋̎̆̊̈͂́̈́̌͊́́̈́̉̏̈́̒̓̕̕͘ ̵̡̧̻͚͕̰̲̲̞͚͉̖̮̹̘͇͓͙͔̳̼͙̖̣͔̠͗̅͑͆̒̈́͆̉̊͒̽̽̂̔̊̃̀̂͊̍͋͐͑̑́̋̒̑̓͐̉͂̍́̃͛͂̀̋̋̚̚̚͝͝͝ͅt̶̡̨̼̪͎̖̟͓͕̟͕̟͓̖̜̺̬͍̬̠̯̱̥̜͇̾̍̐̿̌̈́̃͆͛͆̇͂͊̔̀͑̋̀͗̚͠͝ͅḧ̴̝̳́̆ͅě̶̩̠͙̤̩̌̄͆̉͌̏̆͒̈̐ ̴̘̝̻̲̭̜͉̣̓̓̂͑̂̊̓̎̅̈́̑̉̔̍̊̒͑͛̒͆̈̈̕͠ͅd̶̡̧̖̬̬̬̣̜͕̗͚̩̘̱̝͓̫̼̙̬̱̩͔̥̣͓̝̗̹̗̥̙̈́̔̇́̈́̈́̔̉̀̉͂̓͑̉̈́͐͑̃̑͌̉͑̈́͒̊̈́̔̋͛͂́̈̎̽̀͒̄͝͠͝ā̵̡̠̭̗͇͖̦̺̣͔͇̗̟̋̊̽͆̏̒̎̉̄͋̀̃͐̅͐̓̑̚̚͘̕̕̚͘n̷̡̛͔̟̟̠͕̺̩̞͙̲̭̏͋͆̅͌̔͑̀͋̿̾̆̑͆̅̎͠ģ̸̡̖͉̥̫̬͙̘͔̦́̆̆̽̿͌͒̏̋̈́̓̽̃̈́̉̅̓͌͋̉̅̔̓̿̃͂̉̒̃͑̎̅̈̆̔͑͒̀̔͐͘̕͘̚ě̶̡̡̛͖͈̹̯͍͍̥̰̤̹͚̪͓̥̟͚̺͎͖̘̲͎͎̜̬̦̟̦̟̗̝͉̜̜̠͛̌̇͊͐͛̏̇̍̓̈́̂̾̅̈́͗͊͋͊̒̋̀͒́̿̂͐̚͘͝͠ͅr̸̡̨̧̧̡̛̠̩͎̻̞̳̺̫̹̗̲͕̯̤̺͓̩͙͙̠͙͖̜̩̮̺̺̲̱̤̟̙̩͓̤̗̊̏̒̈́̓͛̒̔̑̾̈́͐̔̿͘͜͜͜ͅ ̸͙͔̳̜͉̪̆̌̓̉̒̓̔̆̏̒͊́̍̇̉̋̅̑́̾̂̎̑̿̚̚͘͜͝i̸̡̡̡̛͙̤͉̮̱̼̩̙̮̞̩̰̤̻̼̰̙͙̗̩̯̺̝͍̞̖͌́̐̀̈̋͆̆͒̀̋͂́̀͗́͗͐̇̈́͆͛̍̽̀̏̌̈́́̅̈́͘̕͝͝͠s̷̨̧̧̼͇͖͔̗̣͓̖͚̮̰̘̮͖̳̺͈̼͍̪͎̘͓̗̠̹͈͔͎̖͍͖̠͉̼̿͆̔͒̾̀͂̍̎̊͊̀̉̃͠͠ͅ ̸̡̜͍̺͍̭̘͓̲͉̥̘̬̟̤͙̼͇͉͈̹̘̬̲͚͋̏̏̋͆̓́̑̒͐͗̈́́̄̄̃̆͌̈́̑͂̈́̆̐̔̄͐̈́͜͜͝͝ͅͅb̴̢̻̜̪̱̘̘͚͎̞̱͈̫͍̞̱͈̗͈̥̝̔̇̽̑̆͆̅̈́͆͌̎͂͌̏̄̅̽͐́̒͛͛̀̐̂̓̂͆̒͒͋̀̈́̚̕̚͘͜͝͠͠ê̸̡͔̥͙̣͖̪̫̼͉͉̓̊͠͝ͅͅḧ̴̡̨̡̛̛̫̻͕͍̮̫̹͓̞̹͙͇̘̜̖͖̭͕̦͇̣̤̭̻̝̦̪͉̞̼͇͗̓̄͗̈́̾͊̑̓́̀̍͑̓͌̆̇̃͑̆̈́̀͑͂̿̍̾̀̒̕͘̚͘̕͜͠͠͝ͅͅï̵̡̢̡̛̜̩̥͎͕̣͍̫͚̟͓͉̻̞͙̟̺̙̼̘̬̥̠̬̟̞̱͕͙̖̻̥͓̰̰͎̹̩̫̙̗̗ņ̸̢̧̲̩̭̤̞͍͎̳̊̿͗̆̂̿̈͠d̵̡̧̠͓̻̱͕̮͚̮͙̜̫̞̻̭͖̤̬͓͔͚̺̖̫̳̞͎̼͉͕̣̹̭̳̤̳̮̦͙͂͐͗̌̾̈́̈̓̔̾,̵̧̨̛͖̜̦̫͖͎̗̬͚̙͈͈̦͚̳̫͈͓̥͎̹̣͈̗͈̯̎̈̈́̉͌͒͐͋͆̾̓͒̈́͌͛̃̇̅̃̎̑̑̽̍͗́̕͜͜͝͠͝ ̷̛̛̛̛̺̲͕́̈́̈́́͑̈́̽̂̅̔̐̅̽̊̆͌͑͒̔͗̆̊͂̒̌̊͋͒̄̊͛̊͊̋̕̚͘͝͝͠͠ắ̶̧̨̧̛̛̛̺͓͓̗͔̰̹̬̤̰̙̘͕̫͕̘̮̞͙̺̻̞̮̳͚͈̫̔̄̈̾̇͂́̓̉̆̉͂̅͊̿̌̓́̕̚͝͠v̷̨̡̢̧̯̮̲̠͖̤̗̬̩̳͕͉͇̣̼͕̮̐͒̉̕͝͠ͅo̷̡̝̦͎̬̟͇̩͈̗̹̲͎̻̣̗̊̓̏̅̍͑̾͑͘͜͝ͅi̶͉̜̜͙̘͍̖̬̔͋̃̏̿̅͋͑͒̕ḑ̷͔̦͈̲̬̘͎̟̱͉̠̪̼̭̹̟̻̮̥̫̪͉͙͙͇̠͎͇̲̠̺̣͉̱̖̱͎̗̹̏́͜";
	buttonWarn2.innerHTML = "Y̴̢̧̧̡̡̨̢̡̧̧̧̡͍̟͖̗͍͍͍͉̩̝̯̜̳̼͍̱̖̼̳̲̲̲͚̻͉̮͚͖̫̩̟͚̯̱̗͇̱̟̩̟͚̪̼͚̘̞͖̬̮̪̫̺̘̯̬̗͙̖̪̰̘̩̹̘̗̪̻͇͈̭͇̳̑́̽̅̈͒̄̾̏̆̒̾̾̔̇̊̑̿͆̈́̅̽̇͘͜͜͝͝͝͝͝͠͝ͅǫ̸̧̢̧̧̡̛̛̛̬̜͈͈̻̪̰̱̙̼̺̖͓̰̖͉͉͎̬͕͈̥̺̬̩͎̤̞̮̮͔̦̯̦̏̈́͑̑́̈̓͗̏̈̐̊̂̃̈́͐̌̈́̒̿̓̽͒͒̊̌̏̏̃̂̒̊̇̀̃̓͌̑͑́̑̏̈͐̈́̾͑̈̈̅̾̇̐̌͊͊́͆͂͆̎̌̐̿͑̄͂̒̀̕̚̕̚͘͜͝͠͝ų̶̧͇͕̹̖̘͕͙͙̞̲̘̣̗̯̝̰̺̱̬̲̺͙̱̺͚͙̩̯̠̪̞̹̩̞̺̗͉͚͔̣͗̓͛̇̍͌̐̀̀̈́͊̓̔̀͒̈́̇̚̚͘̚͜͠ͅ ̵̡̡̧̧̢͖͕̜̻͔̭͍͚̱̬̫͓̟̖̘̺̺̫̖͎̤̩̤̬̘̜͍̳̤͍͉̟̺̟̯͇͚̥͈̘̖͖͙́̅͑̀̀w̵̪̜̳̹͓̥̭̖̫̬̞̖͎̣̞͚̩̰̝̝͖̼̩̲̟̰̟̳̏̓͐̈͊̈̃̃̎̈́̉̎͊̌̿̔̂̈̉̄͘̚͝͝ͅé̷̡̮̲̯̘͇͈̥̂̈́͂̍̌́͊͒̔̿́̎̊̈̀͂̊̈́͐̈́͊̒̅̇̔̈̆̄́̈́̎̍̑͐͊͆̆̋̉͑̊͋̍̈́̒̋́͘͘͘͝͝r̷̨̢̢̡̧̢̡̛̙̼̖̞̞̖̠̺͔̪̰͓̩̯̲͍̺̣̪͍̳͎̟͖͍͎̺͇͖̟͕̘̖͍̫͓̟̬͕̰̮̮̯͍͇̞̼̼͈̀̍́̋͗̀̒͆͜ͅͅę̴̡̨̢̧̧̛̛̛̰͈̙̞̺̙͓͖͖̺͙̱̖̭̟͇͍̼̹̟̥̹̮̣̺̤̳̗͍̠͕̦̦̩̖̥̬͉̞͈̻̹̼̠̘̬̯̙̞̻̩̊̐̈́̈̉̑̃͌͗͒̆̓̊̈̈́̏̆͐̊͛͒̈́̉̄͌̐̎͌̇͊̽͐́́̇̈́̿͐̈̓͑̌͌̄̓̋͑̆͊̚̕͜͜͠͠͝ͅ ̴̧̡̧̘͇̙̰̣̹̜̺͍̥̥̟̻̹͔̹͔̦̼͓̺̣͔̰͈̯̠̥̮̳̖͍̮̭̥͎̏͐͆́̃̃̀̐̊̈̊̎͒͐̑̾̈́͆̿̏̿͌̓̊̓̿̉̉̓̂̚̕̚̕̚͜͜͜͝͝͝͠w̸̨̢̡̡̧̢̨̛̛̛̛̹͓̜̻̟̻͔̬̟̝̦̼̮̗̬̟̦̼̫̮̯͕͇͖̩̬̪̞̪̜͚͖̱̩̘̪̪̯͇̝̮͚̯̝̹̤̟͇͓̩͉̦͇͓͎̩̮̥̩̜͍̲̠͓͚̭͔͖̘̯̪͍̬͓͌̌͐̌̎͋͌̂͌͐͊̅͋̅̽͗͂͆̌̐̽̿́͒͂͌̾̈́̇͆͂̈̉̀͒́̽̀̈͒̽́͂̓͒̓͌͗͑̔͊̑̆͘͝ͅͅͅą̷̨̨̡̨̡̛̱͔̼̻̲̰̰͕̤͖̻̙͔̖͙̗̖͍͍̘͇̞̭͈̳͍̮̘͉͓͓͉̯̹̪̯͚̘͖̯͕̖̮̦̪̠̪͕͇͓̺̠̣̫͍̙̖̰̞͌̇̈͂̓̈́͌̆̓͋͌̇̿̈̀̈́̆̄̀́̇̇͂̄̒̒̋͆͐̐̅͌̕̚̕͜͜͝͠͝ͅͅͅͅr̴̡̬̮͒͆̃̓̐͗̈́̓͌̍̾̓͂́̌̕͝ņ̸̨̧̧̧̧̨̧̡̡̧̠̼͓͙̘͎̖̥̯̺͙̹̭̻̖͉͇̭͕͔̖̫̯̝̠̳͕̬̰̰̺̙͎̮̲̳̠̥̰̠̲͕̘̟̼͉͍̬̦̳̝̱̠̻̟̯̤̩̱͇̳͈͎̱̰̰̜̯̤̯̜͖̪̖̈́͐̒̽͒͂̎̎̈̓͂̐̑͒͐̉̐͂̅̍̃́͜͜͜ͅͅͅȩ̶̨̧̡̡̞̗̝͉̙̼̲͓͎̪̖̘̪͕̥̣͓̻͙̟͕̺̪̹͓̝͙̪͔͍̩̉͗̅̉̈́̔̑̈́̿͌̂̆̅͒̌͂͊͌̃́͑̀̋̌͊̅̀̉̃̽̽͗͌̈́̉̂̊͌̌̽̉̋̂̎́̎́̓̃̏͂͘̕͜͝͝͝͠͠͝͝ͅͅḑ̸̧̢̨̘̘̻̺̜͉͎̳̺̦͈̻͍̺̻̩̺͇̰̻̼̤̥̖̬̘̯̰͙͈̳̠͉̮̬̤̠̺͈̝̤̖̮̩̳̼͖̣̬̤̟̬̮͙̭̫͚̙͓̜̯̣̻̖̮̺̣̬̝̱̇̄̿̎̀̀̈́͑͛̌̓͊̓̈́͂̋̌̆̈́͊̈́̀̊̉̑́̇̈́̋̀̂̑̈̄̎̑̑̀̍̊̌̎̆͗̌͐̆̋̈́̅̈́̀̎͂̏͆̒̒̓̄̈́̐̆̆̅͗̾͑̏͘͘͘̚̚̕͘͘͜͝͝͝͝͠͠ͅ ̸̧̧̨̢̨̡̢̨̛̳̝̭̳͇̼̻͓̻̜̟̻̱̘̠͉̤̝͎̰̟̖̫͈̦̝͚̘̙̖͍͙̘̳̩̮͕̼͔͈̹̟͍̻͖̹̠̹̳̖̙͇̣͚͉̦̈̀͋̀͒͑̋̈̌̒̋̄̾̎̇̄̉̆̃̈̌͆̅̅͂̉͌̋̎̎͛͗̍̓͆̅́͑͒̑̐̓̈͒̎͒̎̈͌͆̔̓̉̑̈́̊̋̽̈́́̏̑́̎͐́̕̕͘̕͜͜͝͝͝͝͠͠͝͠͝ͅi̷̢̨̧̨̠̩̫̙͇̳͕̼͕̼͓̖̖̺̻̳̻͉̱̯̯̠͕̝͈͍̦͓̘̰̱̭͎̲̫̹͍̠̤͔̟̣̥̳͍̝̲͉͙̮͚̦͕̞͑̑̃̚͜ñ̴̡̨̨̧̨̛̞͈͉̥̠̻̲͚̮̯͇̫̘̫͖̯̙̠͖̼͚̗̯̼̖͚̥̺̼̬̤͇̘̣̗̞͔̪̗̟͔͕̼̫̤͍̦̹̝͚̼̠̙̰̻̦͖̬͚̬̦̲̬̱̗͙̙̰̗͙̤̳̖̞̪̟͍̭͓͖͔̣̂̃̔̎̃͆͌̿͌̏̎̇̕̚͜͜͜͝͝͝ ̷̡̨̨̢̧̧̢̧̛̛̹̤̤̝͍̖̥̫̙̱͚̞̯̩̩͙̺̖̦̬͙̣̹̘͍͈͔͕̝̯̰̙̮̝̙̭͉̱̣͍͚͉̮̟̯͖̗̖̞̤͔̩̯̩͚̲̟͚̦̦̠̣̹̗̙̗͓͕̽̿͛̋̈́͌͐̄̑̾͆͐͂̎̒̉̋͌̿̊̅͂̋͋̂̇̎͋̐̃̐̃̓͌̌̊̇͋̾̍̀̊͂͋̍̈̅͛̈̓͆̓̈́̎̕͘͘͠͝͝͝ͅa̶̧̧͎͎͎͖̟̭͓̮̲̼͇͚̟̠̝̲͓̣̻̩͉̻͖̬̟̦͍̼͎̝̥̟̙̪͕̮̳̹̿̍͑̃̈́̈̊̎̄̎̓̎̈́̇͋̆̑̒̾̉̀͑̇͒̾̒̈̏͆̅͌̓̚̚̕͜͜͝͝ͅd̸̡̢̧̻̥̙͚̟̣̘̦͉̯͇͓̼̹͎͓͇̼̖͚̰͙͓̥̻͔̬̤̳̞̲̪̤͉͙̼͓̬̺̰̩̱͙̞̱̩͚̎̏̌̒̓̔͆̔̅͋̍̌̊͂̆͂̃̈́̿̃͊̓̀̑͛̃͑̅͆̈́͐͌̃̈̃̀̈́́̇̋̋̌́̿͊̔̉̒̊̀̈́̽͘͜͜͜͠͠͠͝͝ͅͅͅv̷̡̢̭̹̩̼̩̳͚̰̳̩̠͇̫̣͎͖̣̦͔͈͕̬̟̳̫̪̞̤̦̼̼̤͚̗̝̮̹̠̭̩̹̞̦̬̲͚̣͍̠̯̮͈̊̈̎̐̀̆̈́̒͌̍̔̆̀͑̎̀́̑̓̊̾̉̓̇̐̿̓̿̔̂̾̐̐̈̈́̇͛̆̇̂͌̀͐̓̏̔̃͌̔̓́̀̈́͛̔̽̍̏̒͛̋͗̅̈́͛̒̉̐͂́͋̓̆͘̚̕̕͘͘̚͜͝͝͝͝͝͠͠͝ͅa̴̡̧̨̧̧̨̛̛̛̯̠̟̗̥̺̳̙̹̦̣̜̲̲͎͙̜̖̣͇̥̬̼̬̣̜̱̮̤̼̜̝̯̞̮̻͉̗͔̱̲̜͓̖̖͖̙̥͐̀̐̈́̎͛̊̇̾̀̈́̎̐͒̃͆̐̽͐̿̂̍̌̌͌̊͋̈́͆͛̋̍̌͑̏̄̾̈́̽̒̈́̂̅̉̌͋͐͌̅̋̊͐̉͑͑̓͂͒̋͗̒̔͘̚͘̚͘͘͠͝͠͝͝ṇ̸̢̡̡̰̖̼̼̠̤̦̝̞̘̺̼̤̻̗͍̝̖̬̫̮̳͇̮̞̓̄̑̋͆̅̓̈́͑͆̒͌͌̎͆̏͗̓̌̂̒́͆͒͆͑̏͆̓̈́͌͌͛̈̾̇́̅͋̚̕͜͝͝͝͝͠ć̷̢̧̖͉̺̟͕͈̦̳̼̙̬͈̮̠͍̙̭̮͎̰͈̭̤̰̗͔̼͓̉̄̀̍̏͌͆̆̃̈́̑͒̆̈́̃̍̊̃͂̌̓͊̂̈́̅͒͌̓̍̀̈͗̌͌̆͊͑́͘͘̚͜͠͝͝ͅͅę̵̢̡̨̢̧̨̨̧̛̛̻̬̞̬̖̯͓̫͔̟͇̳̯̻̻͖͕̙̟͖̱̥̲͔̺͇̥̻̦̭͕͖̰͙̰͔̦͔̘̬̙̝̺̫̱̞̮̖̪̘̦͚̺͈̯̜̙͓͒̂̓̍͌̈́͐͌̄̒́̅̾̎̂́̔̒̓͂̀͊͋̈́̔̅͒̔̆̾̍̓́̆̅̒̐̈͛̐̐̀̇̀̔͐̎͑̒́̈̈̂̈́͒̔͑͆̈́̒̀͘͘͜͜͝͝ͅͅͅ.̵̧̧̧̧̡̡̡͖̪̭̪̲͈̩̘̦͇̲̟̻̜̼̮͖̘̝̫̹̟̙͇̩̺̬̰̯͓̝͉͓̯͉͕͇̟̣̘̱̲̖̪̩̝̰͎̟͉̭̖̪̬̗͍̤̟̝͕̣̻̳̘̬͓̐̑͂̉̊̔̾͛̈͆̎̊̀̀̈́͑̅͒͐̽̑͂͛̾͆́̿̌̀̄̿́̿͑̿̎̈́̊̓̈́̓́̑̾͂͆̃̄̎̄̓̉͐̓̔̍̚̕̕̕͘͜͝͝͝ͅͅͅͅ";
});

evilButton.addEventListener('mouseleave', function() {
	buttonWarn.innerHTML = "Since the danger is behind, avoid";
	buttonWarn2.innerHTML = "You were warned in advance.";
});

document.addEventListener('keydown', function(event) {
console.log('key pressed ' + event.key);
if (event.key == 'E') {
window.open("evil.html");
} else if (event.key == 'C'){
window.open("crane.html");
}

});

document.addEventListener('keyup', function(event) {
console.log('Key upped ' + event.key);
});
